{
    "query_line": "2024年度入学の情報科学部生です。2年の必修を教えてください",
    "related_sentences": [
        {
            "id": 2107,
            "text": "情報科学部4学科共通 専門基礎科目：解析学Ⅰ 必修：2単位 １年・前期 解析学Ⅰ演習 必修：1単位 １年・前期 線形代数学Ⅰ 必修：２単位 １年・前期 線形代数学Ⅰ演習 必修：1単位 １年・前期 プログラミングⅠ 必修：２単位 １年・前期 プログラミングⅠ演習 必修：１単位 １年・前期 コンピュータ基礎 必修：2単位 １年・前期 情報科学英語必修：1単位 １年・第2ターム（前期） 解析学Ⅱ 選択：2単位 １年・後期 線形代数学Ⅱ 必修：２単位 １年・後期 実社会指向基礎数学 必修：２単位 １年・後期 プログラミングⅡ 必修：２単位 １年・後期 プログラミングⅡ演習 必修：１単位 １年・後期 データ構造とアルゴリズムⅠ 必修：2単位 １年・後期 情報科学序説 選択：１単位 １年・第3ターム（後期） 離散数学 選択：２単位 ２年・第1ターム（前期） 確率統計 必修：２単位 ２年・第1ターム（前期） 情報基礎数学 選択：2単位 ２年・第2ターム（前期） 幾何学概論 自由：２単位 ２年・第1ターム（前期） 情報ネットワーク 選択：２単位 ２年・第1ターム（前期） データ構造とアルゴリズムⅡ 選択：２単位 ２年・第2ターム（前期） 実践的AI技術 選択：２単位 ２年・第2ターム（前期） 批判的創造的思考法 選択：2単位 ２年・第4ターム（後期） 実践的ICT活用事例 選択：2単位 ２年・第4ターム（後期） 課題解決型演習 選択：１単位 ２年次○地 システム開発実践 選択：２単位 ３年次○地 情報科学基礎実験ａ 必修：１単位 ２年次 情報科学基礎実験ｂ 必修：１単位 ２年次 情報科学基礎実験ｃ 必修：１単位 ２年次 情報セキュリティ基礎 必修：２単位 ２年・第3ターム（後期） モデル化とシミュレーション 選択：２単位 ２年・第3ターム（後期）",
            "score": 0.6758687626210449
        },
        {
            "id": 2099,
            "text": "履修基準：情報科学部 1　総合共通科目 　前ページの表の基準により履修してください。 2　一般情報処理科目 　「情報活用基礎」（２単位）を履修してください。 3　保健体育科目 　「体育実技Ⅰ・体育実技Ⅱ」（各1単位、計2単位）又は「健 康科学」（2単位）のいずれかを選択して履修してください。 両方を履修しても構いませんが、卒業単位としては2単位 しか算入されません。 4　外国語系科目 　「英語応用演習Ⅰ、英語応用演習Ⅱ、英語応用演習Ⅲ、 英語応用演習Ⅳ、ｅラーニング英語Ⅰ、ｅラーニング英語 Ⅱ、ｅラーニング英語Ⅲ、ｅラーニング英語Ⅳ」（各１単位） の計８単位が必修となります。 5　専門教育科目 　情報科学部の専門教育科目は全学科対象の「専門基礎科 目」と各学科ごとの「専門科目」により構成されています。 情報科学部では、２年前期から学科に配属されますが、２ 年前期までは主に「専門基礎科目」を履修し、２年後期か ら各学科ごとの「専門科目」を履修することになります。 　各学科における専門教育科目の履修基準は以下のとおり です。 （1） 情報工学科 　　必修45単位を含め95単位 （2） 知能工学科 　　必修48単位を含め95単位 （3） システム工学科 　　必修45単位を含め95単位 （4） 医用情報科学科 　　必修45単位を含め95単位 6　学科配属について 　情報科学部の学生は、１年後期終了時に、２年次進級が 認められて（原則として前期を１期及び後期を１期、各期 を途中休学することなく、かつ卒業要件となる128単位の うち、20単位以上修得している。）いれば、本人の希望と 成績に基づき、「情報工学科」「知能工学科」「システム工 学科」「医用情報科学科」のいずれかの学科に配属されます。",
            "score": 0.6101527227194681
        },
        {
            "id": 2108,
            "text": "情報科学部情報工学科 専門科目：プログラミングⅢ 選択：２単位 ２年・第2ターム（前期） 常微分方程式 選択：２単位 ２年・第1ターム（前期） 注4 観光情報学 選択：２単位 ２年・第2ターム（前期） ○地 高度プログラミングＡ 選択：１単位 ２年・第1ターム（前期） 高度プログラミングＢ 選択：１単位 ２年・第1ターム（前期） 高度プログラミングＣ 選択：１単位 ２年・第2ターム（前期） 高度プログラミングＤ 選択：１単位 ２年・第2ターム（前期） デジタルデザイン 選択：２単位 ２年・第3ターム（後期） オペレーティングシステム 選択：２単位 ２年・第3ターム（後期） ネットワークプロトコル 選択：２単位 ２年・第3ターム（後期） コンピュータグラフィックスⅠ 選択：２単位 ２年・第4ターム（後期） 注4 コンピュータアーキテクチャ 選択：2単位 ２年・第4ターム（後期） 物理学 選択：２単位 ２年・第4ターム（後期） 情報システム開発 選択：２単位 ２年・第3ターム（後期） 最適化技法 選択：２単位 ２年・第4ターム（後期） 技術者倫理 選択：２単位 ２～４年次・前期 情報と職業 選択：２単位 ２～４年次・前期 知的財産権 選択：２単位 ２～４年次・前期 情報セキュリティ応用 選択：２単位 ３年・第1ターム（前期） データベース 選択：２単位 ３年・第1ターム（前期） 技術英語演習 必修：１単位 ３年・第1ターム（前期） 情報工学実験Ⅰ 必修：1.５単位 ３年・第1ターム（前期） 情報工学実験Ⅱ 必修：1.５単位 ３年・第2ターム（前期） ネットワーク設計 選択：２単位 ３年・第1ターム（前期） コンピュータシステム 選択：2単位 ３年・第2ターム（前期） ネットワーク基盤技術 選択：２単位 ３年・第2ターム（前期） 情報理論 選択：２単位 ３年・第2ターム（前期） 医用データサイエンス 選択：２単位 ３年・第1ターム（前期） リコンフィギャラブルコンピューティング 選択：２単位 ３年・第3ターム（後期） 分散システム 選択：２単位 ３年・第2ターム（前期） ネットワークソフトウェア 選択：２単位 ３年・第2ターム（前期） センサシステム 選択：２単位 ３年・第3ターム（後期） 情報工学実験Ⅲ 必修：1.5単位 ３年・第3ターム（後期） 情報工学実験Ⅳ 必修：1.5単位 ３年・第4ターム（後期） 画像情報処理 選択：２単位 ３年・第4ターム（後期） 注4 設計最適化手法 選択：２単位 ３年・第4ターム（後期） 信頼性工学 選択：２単位 ３年・第4ターム（後期） ワイヤレスネットワーク 選択：２ ３年・第4ターム（後期） トラフィック分析 選択：２単位 ３年・第4ターム（後期） デジタル信号処理 選択：２単位 ３年・第3ターム（後期） プレゼンテーション技法 必修：1単位 ３年・第4ターム（後期） 注3 技術文書作成法　必修：1単位 ４年次注3 卒業研究Ⅰ 必修：４単位 ４年次注3 卒業研究Ⅱ 必修：４単位 ４年次注3 注3 卒業研究等履修要件：（1） 　卒業研究Ⅰ、卒業研究Ⅱはともに履修期間はそれぞれ半期である。 （2） 　卒業研究Ⅰ、卒業研究Ⅱはともに前後期いずれの学期においても履修は可能であるが、卒業研究Ⅱについては、卒 業研究Ⅰの単位修得者にのみ履修が認められる。 （3） 　プレゼンテーション技法、技術文書作成法はともに履修期間はそれぞれ半期である。 （4） 　原則として、技術文書作成法は卒業研究Ⅱと同じ履修期に履修すること。 注4：教職課程登録者のみ履修登録可 ",
            "score": 0.5812909649861356
        },
        {
            "id": 2110,
            "text": "情報科学部システム工学科 専門科目：常微分方程式 選択：２単位 ２年・第1ターム（前期） 観光情報学 選択：２単位 ２年・第2ターム（前期） ○地 高度プログラミングＡ 選択：１単位 ２年・第1ターム（前期） 高度プログラミングＢ 選択：１単位 ２年・第1ターム（前期） 高度プログラミングＣ 選択：１単位 ２年・第2ターム（前期） 高度プログラミングＤ 選択：１単位 ２年・第2ターム（前期） 電気回路 選択：２単位 ２年・第2ターム（前期） プログラミングⅢ 選択：２単位 ２年・第1ターム（前期） プログラミングⅢ演習 選択：１単位 ２年・第2ターム（前期） 物理学 選択：２単位 ２年・第4ターム（後期） 情報理論 選択：２単位 ２年・第1ターム（前期） 応用幾何学 選択：２単位 ２年・第3ターム（後期） 情報システム開発 選択：２単位 ２年・第3ターム（後期） 機械力学 選択：２単位 ２年・第3ターム（後期） 電子回路 選択：２単位 ２年・第4ターム（後期） コンピュータグラフィックス 選択：２単位 ２年・第4ターム（後期） 離散時間システム 選択：２単位 ２年・第4ターム（後期） オペレーティングシステム 選択：２単位 ２年・第3ターム（後期） 数値計算法 選択：２単位 3年・第1ターム（前期） 知的財産権 選択：２単位 ２～４年・前期 情報と職業 選択：２単位 ２～４年・前期 技術者倫理 選択：2単位 ２～４年・前期 システム工学実験Ⅰ 必修：1.5単位 3年・第1ターム（前期） システム工学実験Ⅱ 必修：1.5単位 3年・第2ターム（前期） メカトロニクス 選択：２単位 3年・第2ターム（前期） 制御工学Ⅰ 選択：２単位 3年・第2ターム（前期） ロボティクスⅠ 選択：２単位 3年・第1ターム（前期） 最適化手法 選択：２単位 3年・第1ターム（前期） ディジタル無線通信 選択：２単位 3年・第2ターム（前期） 外書講読演習 必修：１単位 3年・第2ターム（前期） 情報代数学 選択：２単位 3年・第1ターム（前期） 確率過程論 選択：２単位 3年・第1ターム（前期） データベース 選択：２単位 3年・第1ターム（前期） 注4 ヒューマンインタフェースⅠ 選択：２単位 3年・第1ターム（前期） 医用データサイエンス 選択：２単位 3年・第1ターム（前期） ヒューマンインタフェースⅡ 選択：２単位 3年・第2ターム（前期） ソフトウエア工学概論 選択：２単位 3年・第3ターム（後期） 画像情報処理 選択：２単位 3年・第1ターム（前期） 制御工学Ⅱ 選択：２単位 ３年・第3ターム（後期） 偏微分方程式 選択：２単位 ３年・第4ターム（後期） ロボティクスⅡ 選択：２単位 ３年・第3ターム（後期） パターン認識 選択：２単位 ３年・第2ターム（前期） 情報セキュリティ応用 選択：２単位 ３年・第4ターム（後期） ソフトコンピューティング 選択：２単位 ３年・第4ターム（後期） システム工学実験Ⅲ 必修：1.5単位 ３年・第3ターム（後期） システム工学実験Ⅳ 必修：1.5単位 ３年・第4ターム（後期） プレゼンテーション技法 必修：1単位 4年次注3 技術文書作成法 必修：1単位 4年次注3 卒業研究Ⅰ 必修：４単位 4年次注3 卒業研究Ⅱ 必修：４単位 4年次注3 注3：卒業研究等履修要件（1）卒業研究Ⅰ、卒業研究Ⅱはともに履修期間はそれぞれ半期である。 （2） 　卒業研究Ⅰ、卒業研究Ⅱはともに前後期いずれの学期においても履修は可能であるが、卒業研究Ⅱについては、卒 業研究Ⅰの単位修得者にのみ履修が認められる。 （3） 　プレゼンテーション技法、技術文書作成法はともに履修期間はそれぞれ半期である。 （4） 　原則として、プレゼンテーション技法は卒業研究Ⅰと同じ履修期に、技術文書作成法は卒業研究Ⅱと同じ履修期に 履修すること。 注4：教職課程登録者のみ履修登録可",
            "score": 0.5684314155716048
        },
        {
            "id": 2100,
            "text": "イノベーション人材育成プログラム（情報科学部）：情報科学部では、ICT活用に不可欠なプログラミングや情 報科学の基礎となる数学において秀でた能力を、学習意欲 と共にさらに伸ばす「イノベーション人材育成プログラム」 により、社会にイノベーションをもたらし得る人材を育成 します。 　本プログラムでは、標準で開講されている科目群に加え、 実践的な情報技術のプロフェッショナルを育成する「革新 的 ICT 実践特別コース」、科学的探究能力をもつIT技術者を 育成する「革新的情報科学特別コース」、および両者の共通 科目群の科目を履修できます。いずれの科目群でも創造力 を養うことができます。総合型選抜推薦入試による入学者 は優先的に履修できますが、情報科学部に入学したすべて の学生が履修にチャレンジできます。 　本プログラムは大学院との一貫カリキュラムを想定して おり、所定の成績でプログラムを修了した学生は、通常４ 年次で履修する卒業研究を飛ばして、早期に大学院に進学 し先端的な研究を開始することができます。 　本プログラムを修了することで、ICTに必要な基本知識や 動作原理を身につけるのみならず、社会の課題に目を向け、 創造的な解決策に挑戦するマインドが身につきます。社会 の変化とニーズに対応できる実践的なICT人材として活躍できます。",
            "score": 0.5639498073435839
        },
        {
            "id": 2109,
            "text": "情報科学部知能工学科 専門科目：オートマトンと形式言語 必修：２単位 2年・第2ターム（前期） 常微分方程式 選択：２単位 2年・第1ターム（前期） 注4 観光情報学 選択：２単位 2年・第2ターム（前期） ○地 高度プログラミングＡ 選択：１単位 2年・第1ターム（前期） 高度プログラミングＢ 選択：１単位 2年・第1ターム（前期） 高度プログラミングＣ 選択：１単位 2年・第2ターム（前期） 高度プログラミングＤ 選択：１単位 2年・第2ターム（前期） 数理計画法 選択：２単位 2年・第3ターム（後期） 数理論理学 選択：２単位 2年・第3ターム（後期） コンピュータグラフィックスⅠ 選択：２単位 2年・第4ターム（後期） プログラミングⅢ 選択：2単位 2年・第3ターム（後期） プログラミングⅢ演習 選択：1単位 2年・第3ターム（後期） グラフ理論 選択：２単位 2年・第4ターム（後期） オペレーティングシステム 選択：２単位 2年・第4ターム（後期） ディジタル信号処理 選択：２単位 2年・第3ターム（後期） 数値解析 選択：２単位 2年・第4ターム（後期） 情報システム開発 選択：２単位 2年・第3ターム（後期） ソフトウェア工学概説 選択：２単位 3年・第4ターム（後期） 技術者倫理 選択：２単位 ２～４年次・前期 情報と職業 選択：２単位 ２～４年次・前期 知的財産権 選択：２単位 ２～４年次・前期 情報理論 選択：２単位 3年・第1ターム（前期） 記号処理プログラミング 選択：２単位 3年・第1ターム（前期） データベース 選択：2単位 3年・第1ターム（前期） 人工知能 選択：２単位 3年・第2ターム（前期） 技術英語演習Ⅰ 必修：１単位 3年・第4ターム（後期） 知能工学実験Ⅰ 必修：1.5単位 3年・第1ターム（前期） 知能工学実験Ⅱ 必修：1.5単位 3年・第2ターム（前期） コンパイラ 選択：２単位 3年・第2ターム（前期） 計算論 選択：２単位 3年・第2ターム（前期） コンピュータグラフィックスⅡ 選択：２単位 3年・第2ターム（前期） パターン認識 選択：２単位 3年・第2ターム（前期） 情報検索 選択：２単位 3年・第3ターム（後期） 医用データサイエンス 選択：２単位 3年・第1ターム（前期） 自然言語処理 選択：２単位 3年・第1ターム（前期） 医用画像処理 選択：２単位 3年・第3ターム（後期） データマイニング 選択：２単位 3年・第3ターム（後期） バイオインフォマティクスⅠ 選択：１単位 3年・第3ターム（後期） バイオインフォマティクスⅡ 選択：１単位 3年・第4ターム（後期） 知能工学実験Ⅲ 必修：1.5単位 ３年・第3ターム（後期） 知能工学実験Ⅳ 必修：1.5単位 ３年・第4ターム（後期） 機械学習 選択：２単位 ３年・第4ターム（後期） 感性情報処理 選択：２単位 ３年・第3ターム（後期） 画像情報処理 選択：２単位 ３年・第4ターム（後期） プレゼンテーション技法　必修：1単位 4年次注3 技術英語演習Ⅱ 必修：1単位 4年次注3 技術文書作成法　必修：1単位 4年次注3 卒業研究Ⅰ 必修：4単位 4年次注3 卒業研究Ⅱ 必修：4単位 4年次注3 注3：卒業研究等履修要件 （1） 　卒業研究Ⅰ、卒業研究Ⅱはともに履修期間はそれぞれ半期である。 （2） 　卒業研究Ⅰ、卒業研究Ⅱはともに前後期いずれの学期においても履修は可能であるが、卒業研究Ⅱについては、卒 業研究Ⅰの単位修得者にのみ履修が認められる。 （3） 　プレゼンテーション技法、技術英語演習Ⅱ、技術文書作成法はともに履修期間はそれぞれ半期である。 （4） 　原則として、プレゼンテーション技法及び技術英語演習Ⅱは卒業研究Ⅰと同じ履修期に、技術文書作成法は卒業研 究Ⅱと同じ履修期に履修すること。 注4：教職課程登録者のみ履修登録可",
            "score": 0.5536859026807888
        },
        {
            "id": 2097,
            "text": "教育課程編成・実施の方針（カリキュラム・ポリシー） 　情報科学部が掲げる学位授与方針（ディプロマ・ポリシー）を達成するため、教育課程を次のように編成する。 （全学共通系科目） ・ 幅広い教養・知識の修得を通じ、多様な価値観を尊び平和を希求する精神や感性豊かな人間性を涵養するとともに、グロー バル化・情報化等に対応できる能力を身に付けるため、全学共通系科目・外国語系科目を教育課程に組み入れる。 （情報科学系・情報工学系科目） ・ 急速に発展する情報通信技術 （ICT） に適応しながら次世代の情報化社会を創造する人材を育成するため、情報科学、情 報工学、計算機科学、計算機工学とその応用を修得する次の２系統の科目を学部共通科目・専門基礎科目・専門科目のそ れぞれに編成する。 　（1）　情報科学系科目：高度情報化社会を支える技術の基盤となる自然科学とその応用に関する科目 　（2）　情報工学系科目：高度情報化社会を実現するために必要な知識と基礎技術及びその応用に関する科目 （数学、プログラミング及び英語の重点的な教育） ・ 情報科学または情報工学を学ぶ上で特に重要な基礎科目である数学、プログラミングは１〜２年次に、英語は１〜３年次 に重点的な教育を行う。教育にあたっては、コンピュータ及び情報関連機器を用いた情報処理能力が身に付くように、継続的に情報機器の利用とそれによる学習が可能になるように配慮する。また、英語教育については、一般的な内容から専 門分野における内容まで学習できるように科目を配置する。 （学部共通科目） ・ 情報科学または情報工学の基礎的・普遍的な知識・技能を修得するため、学部共通科目を開設する。また、学部共通科目 を履修した上で、学生一人ひとりの興味関心、適性に基づいて専門分野を適切に選択できる仕組みを導入する。 （専門基礎科目） ・ 各学科の専門分野における基礎的な知識・技能及び思考力・判断力・表現力を修得するため、情報科学及び情報工学に関 する専門基礎科目を主に２年次に開設する。 （1） 　情報工学科：技術者や研究者に求められる情報工学の基本的な知識が身に付くように、コンピュータ、ネットワー ク、コミュニケーション基盤の分野を横断した内容の科目を２・３年次に配置する。 （2） 　知能工学科：知識情報処理、メディア情報処理、及びそれらに関連する数理を中心とした知能工学全般に共通して 必要な能力を身に付けるための専門基礎科目を２年次に配置する。 （3） 　システム工学科：システム工学科では、情報システム全体の調和と協調を図った創造的なシステム化技術を学ぶ。 それに必要となる数学・情報・工学に関する基礎的な科目を２年次に配置する。 （4） 　医用情報科学科：医用情報科学または医用情報工学分野などの異分野融合領域を支える３つの普遍的学問領域（情 報系科目、工学系科目、自然科学系科目）を専門基礎として開設する。 （専門科目） ・ 各学科の専門分野における専門的な知識・技能及び思考力・判断力・表現力を修得するため、情報科学及び情報工学に関 する専門科目をそれぞれ主に３年次に開設する。 （1） 　情報工学科：３年次にコンピュータ、ネットワーク、コミュニケーション基盤の各分野における専門性を高める専門科目を配置する。（2） 　知能工学科：知識情報処理、メディア情報処理、及びそれらに関連する数理を中心とした各知能工学分野の専門的 な能力を身に付けるための専門科目を３年次に配置する。 （3） 　システム工学科：体系的に専門知識が身に付くようにシステム基礎、ロボット・人間共生、インタフェースデザイ ンの各専門系列科目を３年次に配置する。 （4） 　医用情報科学科：専門基礎科目を土台として、３つの普遍的学問領域（情報系科目、工学系科目、自然科学系科目） を医用、生命、環境などへ応用展開する医用情報科学系科目を開設する。 （実験科目、卒業研究） ・ 実験、演習、口頭発表などの体験的・総合的な学修を重視した以下の科目を開設する。 （1）　学部共通科目で習得した知識を具体的な問題に適用する能力を育成する実験科目 （2） 　専門基礎科目・専門科目で習得した知識を具体化させ、思考力・洞察力を養い、実際的な問題・課題を解決する能 力を育成する実験科目 （3） 　研究に対する方法論、問題解決力を身に付け、研究の成果・意義・有用性を論理的にまとめ、発表・討論する能力 を育成する以下の２種類のテーマでの卒業研究 　　・情報科学・自然科学における真理の探究を目的としたテーマ 　　・情報科学の利活用による課題解決を目的としたテーマ",
            "score": 0.5404838577002599
        },
        {
            "id": 2111,
            "text": "情報科学部医用情報科学科 専門科目：化学 選択：２単位 ２年・第2ターム（前期） 観光情報学 選択：２単位 ２年・第2ターム（前期） ○地 高度プログラミングＡ 選択：１単位 ２年・第1ターム（前期） 高度プログラミングＢ 選択：１単位 ２年・第1ターム（前期） 高度プログラミングＣ 選択：１単位 ２年・第2ターム（前期） 高度プログラミングＤ 選択：１単位 ２年・第2ターム（前期） 回路工学基礎Ⅰ 選択：１単位 ２年・第1ターム（前期） 回路工学基礎Ⅱ 選択：１単位 ２年・第2ターム（前期） 医科学概論Ⅰ 選択：１単位 ２年・第1ターム（前期） 医科学概論Ⅱ 選択：１単位 ２年・第2ターム（前期） 力学 選択：２単位 ２年・第4ターム（後期） 幾何光学・波動 選択：２単位 ２年・第3ターム（後期） 電気磁気学 選択：2単位 ２年・第4ターム（後期） プログラミングⅢ 選択：２単位 ２年・第4ターム（後期） 回路工学応用 選択：２単位 ２年・第3ターム（後期） 生物学Ⅰ 選択：１単位 ２年・第3ターム（後期） 生物学Ⅱ 選択：１単位 ２年・第4ターム（後期） 医用情報システム開発 選択：２単位 ２年・第4ターム（後期） オペレーティングシステム 選択：２単位 ２年・第3ターム（後期） 注4 情報システム開発 選択：２単位 ２年・第3ターム（後期） 情報と職業 選択：２単位 ２～４年・前期 技術者倫理 選択：2単位 ２～４年・前期 知的財産権 選択：２単位 ２～４年・前期 技術英語実践演習Ⅰ 必修：0.5単位 ３年・第1ターム（前期） 技術英語実践演習Ⅱ 必修：0.5単位 ３年・第2ターム（前期） 医用情報科学実験Ⅰ 必修：1.5単位 ３年・第1ターム（前期） 医用情報科学実験Ⅱ 必修：1.5単位 ３年・第2ターム（前期） 医用データサイエンス 選択：２単位 ３年・第1ターム（前期） 医用情報科学のための病院実習 選択：１単位 ３年・第2ターム（前期） ディジタル信号処理 選択：２単位 ３年・第1ターム（前期） 機械工学 選択：２単位 ３年・第1ターム（前期） データベース 選択：２単位 ３年・第1ターム（前期） 注4 量子力学 選択：１単位 ３年・第1ターム（前期） 統計力学 選択：１単位 ３年・第2ターム（前期） 制御工学 選択：２単位 ３年・第2ターム（前期） 電気電子計測 選択：２単位 ３年・第2ターム（前期） 分子生物学Ⅰ 選択：１単位 ３年・第1ターム（前期） 分子生物学Ⅱ 選択：１単位 ３年・第2ターム（前期） 医用生体画像計測 選択：２単位 ３年・第2ターム（前期） バイオインフォマティクスⅠ 選択：１単位 ３年・第3ターム（後期） バイオインフォマティクスⅡ 選択：１単位 ３年・第4ターム（後期） 生物工学 選択：2単位 ３年・第4ターム（後期） ワイヤレスネットワーク 選択：２単位 ３年・第4ターム（後期） 注4 医用画像処理 選択：２単位 ３年・第3ターム（後期） 医用ロボット工学 選択：２単位 ３年・第4ターム（後期） バイオメカニクス 選択：選択：２単位 ３年・第3ターム（後期） 生体情報工学 選択：２単位 ３年・第3ターム（後期） 医用情報通信工学 選択：２単位 ３年・第4ターム（後期） 医用情報科学実験Ⅲ 必修：1.5単位 ３年・第3ターム（後期） 医用情報科学実験Ⅳ 必修：1.5単位 ３年・第4ターム（後期） プレゼンテーション技法 必修：1単位 ４年次注3 技術文書作成法 必修：1単位 ４年次注3 卒業研究Ⅰ 必修：4単位 ４年次注3 卒業研究Ⅱ 必修：4単位 ４年次 注3：卒業研究等履修要件 （1）卒業研究Ⅰ、卒業研究Ⅱはともに履修期間はそれぞれ半期である。 （2） 　卒業研究Ⅰ、卒業研究Ⅱはともに前後期いずれの学期においても履修は可能であるが、卒業研究Ⅱについては、卒 業研究Ⅰの単位修得者にのみ履修が認められる。 （3） 　プレゼンテーション技法、技術文書作成法はともに履修期間はそれぞれ半期である。 （4） 　原則として、プレゼンテーション技法は卒業研究Ⅰと同じ履修期に、技術文書作成法は卒業研究Ⅱと同じ履修期に 履修すること。 注4：教職課程登録者のみ履修登録可",
            "score": 0.5309112824529367
        },
        {
            "id": 2104,
            "text": "全学共通系科目 総合共通科目 広島・地域志向科目 広島の観光学 選択：2単位 1・2年・前期 対象:全学部○地 ひろしま論 選択：2単位 1・2年・前期 対象:全学部○地 広島の産業と技術 選択：2単位 1・2年・後期 対象:全学部○地 地域再生論入門 選択：2単位 1・2年・前期 対象:全学部○地 NPO論 選択：2単位 1・2年・前期 対象:全学部○地 地域課題演習 選択：1単位 1・2年次 対象:全学部○地 平和科目 平和と人権A（ヒロシマと国際平和）選択：2単位 1・2年・前期 対象:全学部 平和と人権Ｂ（現代世界と人権）選択：2単位 1・2年・後期 対象:全学部 広島からの平和学：実践の方法 選択：2単位 1・2年・前期 対象:全学部 国際化時代の平和 選択：2単位 1・2年・後期 対象:全学部 「ヒロシマ」を考える 選択：2単位 1・2年・後期 対象:全学部 共通科目A （人間と社会） 哲学 選択：2単位 1・2年・後期 対象:全学部 世界の宗教 選択：2単位 1・2年・前期 対象:全学部 心理学 選択：2単位 1・2年・後期 対象:全学部 歴史学 選択：2単位 1・2年・前期 対象:全学部 現代史Ａ 選択：2単位 1・2年・前期 対象:全学部 現代史Ｂ 選択：2単位 1・2年・後期 対象:全学部 文学から学ぶ世界 選択：2単位 1・2年・後期 対象:全学部 法学（日本国憲法） 選択：2単位 1・2年・前後期 対象:全学部注2 政治学 選択：2単位 1・2年・後期 対象:全学部 経済学 選択：2単位 1・2年・前期 対象:全学部 社会学 選択：2単位 1・2年・前期 対象:全学部 文化人類学 選択：2単位 1・2年・後期 対象:全学部 自然人類学 選択：2単位 1・2年・前期 対象:全学部 経営学 選択：2単位 1・2年・後期 対象:全学部 心の健康・身体の健康 選択：2単位 1・2年・前期 対象:全学部 メディアと社会 選択：2単位 1・2年・後期 対象:全学部 自己の認識を深める 選択：2単位 1・2年・前期 対象:全学部 人間関係とコミュニケーション 選択：2単位 1・2年・後期 対象:全学部 共通科目B（数理と自然） 基礎物理学 選択：2単位 1・2年・前期 対象:全学部注3  基礎化学 選択：2単位 1・2年・前期 対象:全学部注3  基礎生物学 選択：2単位 1・2年・後期 対象:全学部注3  物理・化学実験 選択：2単位 1・2年・後期 対象:全学部注3 地球環境論 選択：2単位 1・2年・前期 対象:全学部 情報社会論 選択：2単位 1・2年・後期 対象:全学部 データサイエンス 選択：2単位 1・2年・後期 対象:全学部 共通科目C （芸術） デッサン概論 選択：2単位 1・2年 前期 対象:国際・情報 油絵入門 選択：2単位 1・2年・第3ターム（後期） 対象:国際・情報 日本画入門 選択：2単位 1・2年・第3ターム（後期） 対象:国際・情報 立体造形概論 選択：2単位 1・2年後期 対象:・国際・情報 プレゼンテーション概論 選択：2単位 1・2年 対象:・前期全学部 デザイン工芸概論 選択：2単位 1・2年 対象:・後期全学部 コンピュータ・アート 選択：2単位 2年 対象:・後期全学部注4 創作と人間 選択：2単位 1・2年 対象:・前期全学部 初年次演習科目 3学部合同基礎演習 必修：1単位 1年 対象:・前期全学部 キャリア形成・実践科目 キャリアデザインⅰ 選択：1単位 1・2年・第1ターム（前期） 対象:全学部 キャリアデザインⅱ 選択：1単位 1・2年・第4ターム（後期） 対象:全学部 キャリアサポートベーシックＡ 選択：1単位 対象:2・3年・前期全学部 キャリアサポートベーシックＢ 選択：1単位 対象:2・3年・後期全学部 仕事体験演習　選択：1単位 1・2年 対象:・通年全学部 国際交流演習Ⅰ 選択：1単位 1 ～ 4年 対象:・通年全学部 国際交流演習Ⅱ 選択：1単位 1 ～ 4年 対象:・通年全学部 国際交流演習Ⅲ 選択：1単位 1 ～ 4年 対象:・通年全学部 国際交流演習Ⅳ 選択：1単位 1 ～ 4年 対象:・通年全学部 一般情報処理科目 情報活用基礎 必修：２単位 1年前期 対象：全学部注5 保健体育科目 健康科学 選択：2単位 1年・前期全学部 体育実技Ⅰ 選択：1単位 1年 対象：・前期全学部注6 体育実技Ⅱ 選択：1単位 1年 対象：・後期全学部注6 注1：履修時期は1年次でも2年次でもよいため、専門教育科目とのバランスを考えながら履修時期を決めてください。ただ し、3年次、4年次においても下年次履修は可能です。 注2：「法学（日本国憲法）」は、前期、後期どちらにも開講しますが、前期は国際学部生、後期は情報科学部生及び芸術学 部生を対象とします。 注3：対象学部は「全学部」としていますが、主として情報科学部の学生向けの講義内容となっています。 注4：対象学部は「全学部」としていますが、主として国際学部及び芸術学部の学生向けの講義内容となっています。 注5：情報科学部は第１ターム（前期）に行います。 注6：「体育実技Ⅰ」の種目は初回授業で、「体育実技Ⅱ」の種目は「体育実技Ⅰ」の最終授業で、希望調査を行い決定します。 再履修を希望する場合は、担当教員に相談してください。",
            "score": 0.527458341249809
        },
        {
            "id": 2105,
            "text": "外国語系科目 英語科目： eラーニング英語Ⅰ 必修：1単位 1年・前期 対象：情報 eラーニング英語Ⅱ 必修：1単位 1年・後期 対象：情報 eラーニング英語Ⅲ 必修：1単位 2年・前期 対象：情報 eラーニング英語Ⅳ 必修：1単位 2年・後期 対象：情報 英語応用演習Ⅰ 必修：1単位 1年・前期 対象：全学部 英語応用演習Ⅱ 必修：1単位 1年・後期 対象：全学部 英語応用演習Ⅲ 必修：1単位 2年・前期 対象：情報 英語応用演習Ⅳ 必修：1単位 2年・後期 対象：情報 英語以外の外国語系科目：ドイツ語Ⅰ 選択：2単位 1年・前期 対象：全学部 ドイツ語Ⅱ 選択：2単位 1年・後期 対象：全学部 ドイツ語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 ドイツ語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 フランス語Ⅰ 選択：2単位 1年・前期 対象：全学部 フランス語Ⅱ 選択：2単位 1年・後期 対象：全学部 フランス語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 フランス語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 中国語Ⅰ 選択：2単位 1年・前期 対象：全学部 中国語Ⅱ 選択：2単位 1年・後期 対象：全学部 中国語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 中国語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 ハングルⅠ 選択：2単位 1年・前期 対象：全学部 ハングルⅡ 選択：2単位 1年・後期 対象：全学部 ハングルⅢ 選択：2単位 1・2年・前期 対象：全学部注8  ハングルⅣ 選択：2単位 1・2年・後期 対象：全学部注8 アラビア語Ⅰ 選択：2単位 1年・前期 対象：全学部 アラビア語Ⅱ 選択：2単位 1年・後期 対象：全学部 アラビア語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 アラビア語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 ロシア語Ⅰ 選択：2単位 1年・前期 対象：全学部 ロシア語Ⅱ 選択：2単位 1年・後期 対象：全学部 ロシア語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 ロシア語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 イタリア語Ⅰ 選択：2単位 1年・前期 対象：全学部 イタリア語Ⅱ 選択：2単位 1年・後期 対象：全学部 イタリア語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 イタリア語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 スペイン語Ⅰ 選択：2単位 1年・前期 対象：全学部 スペイン語Ⅱ 選択：2単位 1年・後期 対象：全学部 スペイン語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 スペイン語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 日本語Ⅰ 選択：2単位 1年・前期 対象：全学部注9 日本語Ⅱ 選択：2単位 1年・後期 対象：全学部注9 日本語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8注9 日本語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8注9 注7：前期・後期とも開講するので、国際学部の学生は別途掲示するクラス分け表により前期又は後期のいずれかを履修すること。注8：１年生が履修する場合は、科目担当教員の承認が必要です。 注9：外国人留学生対象の科目であり、日本人学生は履修できません。",
            "score": 0.5170241436481279
        }
    ]
}