{
    "query_line": "2021年度入学の国際学部です。高校の英語教員免許を貰うために必要な科目、単位数を教えてください",
    "related_sentences": [
        {
            "id": 282,
            "text": "国際学部　国際学科　免許種：中学校教諭一種免許状（英語）、高等学校教諭一種免許状（英語）教科に関する専門事項 最低取得単位数：中一種免28単位 高一種免24単位　授業科目/単位数/中一種免(必修か選択)/高一種免(必修か選択)：アメリカ教育論　2 ⚫︎ ⚫︎ 英語学概論Ⅰ 2 ○ ○ 英語学概論Ⅱ 2 ○ ○ 英文法論 2 ● ● 英米文学概論Ⅰ 2 ○ ○ 英米文学概論Ⅱ 2 ○ ○ Special Lecture in British and American LiteratureⅠ 2 ● ● Special Lecture in British and American LiteratureⅡ 2 ● ● Communication in EnglishⅠ 1 ○ ○ Communication in EnglishⅡ 1 ○ ○ 英語聴解法2 ● ● 英文構成法Ⅰ 2 ● ● 英文構成法Ⅱ 2 ● ● 時事英語2 ● ● 英語読解法Ⅰ 2 ● ● 英語読解法Ⅱ 2 ● ● 英文作法Ⅰ 2 ● ● 英文作法Ⅱ 2 ● ● 英語討論技法Ⅰ 2 ● ● 英語討論技法Ⅱ 2 ● ● 翻訳論Ⅰ 2 ● ● 翻訳論Ⅱ 2 ● ● イギリス文化論Ⅰ 2 ○ ○ イギリス文化論Ⅱ 2 ○ ○ American CultureⅠ 2 ○ ○ American CultureⅡ 2 ○ ○ コミュニケーション技法論Ⅰ 2 ● ● コミュニケーション技法論Ⅱ 2 ● ● 各教科の指導法：教科教育法（英語）AⅠ 2 ○ ● 教科教育法（英語）AⅡ 2 ○ ● 教科教育法（英語）BⅠ 2 ○ ○ 教科教育法（英語）BⅡ 2 ○ ○ ※中学校教諭一種免許状を「中一種免」、高等学校教諭一種免許状を「高一種免」で表示。※免許取得における必修科目を「○」、選択科目を「●」で表示。（卒業要件における必修・選択・自由の区分については、教育課程表を参照すること。） ※最低修得単位数を超えて修得した単位は、「大学が独自に設定する科目」の単位数に算入することができる。",
            "score": 0.7221459839757746
        },
        {
            "id": 292,
            "text": "免許状の種類：本学で取得できる免許状の種類は、次のとおりです。国際学部国際学科　中学校教諭一種免許状（英語）高等学校教諭一種免許状（英語）",
            "score": 0.6338357166777537
        },
        {
            "id": 284,
            "text": "全学部・全免許種共通・中学校教諭一種免許状を「中一種免」、高等学校教諭一種免許状を「高一種免」で表示・免許状取得における選択科目を「●」で表示（必修科目なし）大学が独自に設定する科目：最低取得単位数：中一種免4単位 高一種免12単位 授業科目/単位数/中一種免(必修か選択)/高一種免(必修か選択)：学校インターンシップ2 2 ～ 4年次● ● 国際学部、芸術学部のみ履修可 教職特講2 3年・後期● ● 道徳教育論2 2年・後期●※「教科及び教科の指導法に関する科目」又は「教育の基礎的理解に関する科目等」において、最低修得単位数を超えて修得した単位は「大学が独自に設定する科目」に算入することができる。",
            "score": 0.6323818267009198
        },
        {
            "id": 283,
            "text": "教育の基礎的理解に関する科目等：全学部・全免許種共通・中学校教諭一種免許状を「中一種免」、高等学校教諭一種免許状を「高一種免」で表示・免許状取得における必修科目を「○」、選択科目を「●」で表示 教育の基礎的理解に関する科目：最低取得単位数：10 授業科目/単位数/中一種免(必修か選択)/高一種免(必修か選択)：教育原理２ 2年・前期○ ○ 教師論２ 1年・後期○ ○ 教育経営学２ 3年・前期○ ○ 学習の過程教育心理学２ 2年・後期○ ○ 生徒に対する理解特別支援教育論１ 3年・前期 ○ ○（カリキュラム・マネジメントを含む。） 教育課程論１ 2年・第3ターム（後期） ○ ○ 道徳、総合的な学習の時間等の指導法及び生徒指導、教育相談等に関する科目：最低取得単位数：中一種免10単位　高一種免8単位　授業科目/単位数/中一種免(必修か選択)/高一種免(必修か選択)：道徳教育論２ 2年・後期○ 総合的な学習の時間論１ 2年・第3ターム（後期） ○ ○ 特別活動論１ 3年・第4ターム（後期） ○ ○ 教育方法・技術論１ 2年・第3ターム（後期） ○ ○ 情報通信技術を活用した教育の理論１ 2年・第4ターム（後期） ○ ○ 生徒・進路指導論２ 2年・前期○ ○ 教育相談論２ 2年・前期○ ○ 教育実践に関する科目：最低取得単位数：中一種免5単位　高一種免3単位 授業科目/単位数/中一種免(必修か選択)/高一種免(必修か選択)：教育実習Ⅰ ３ 4年次○ ○ 教育実習Ⅱ ２ 4年次○ ● 教育実践に関する科目：最低取得単位数：2単位 授業科目/単位数/中一種免(必修か選択)/高一種免(必修か選択)：教職実践演習（中等）Ａ ２ 4年・後期 ○ ○ 教職実践演習（中等）Ｂ ２ 4年・後期 ○ ○ 教職実践演習（中等）Ｃ ２ 4年・後期 ○ ○※ 高一種免において、最低修得単位数を超えて修得した単位は「大学が独自に設定する科目」の単位数に算入することができる。 ※「教育実習」は受講要件あり（56ページ参照）。 ※ 教職実践演習について、国際学部の学生は教職実践演習（中等）Ａを、情報科学部の学生は教職実践演習（中等）Bを、 芸術学部の学生は教職実践演習（中等）Cを履修すること。",
            "score": 0.6261099169149446
        },
        {
            "id": 293,
            "text": "履修科目：「教科及び教科の指導法に関する科目」、「教育の基礎的理解に関する科目等」及び「大学が独自に設定する科目」から合計59単位以上修得するとともに、「教職免許法施行規則第６６ 条の６に定める科目」から所定の単位を修得する必要があります。詳細については２年次にガイダンス等で説明があります。中学校教諭一種免許状 一種免許状①教科及び教科の指導法に関する科目28単位以上②教育の基礎的理解に関する科目等27単位以上③大学が独自に設定する科目（注）4単位以上 計59単位以上④教職免許法施行規則第66条の6に定める科目：法学（日本国憲法）　2単位ほか⑤介護等体験（7日間） 必要　高等学校教諭一種免許状①教科及び教科の指導法に関する科目24単位以上②教育の基礎的理解に関する科目等23単位以上③大学が独自に設定する科目（注）12単位以上④教職免許法施行規則第66条の6に定める科目：法学（日本国憲法）　2単位ほか⑤介護等体験（7日間）不要（注）①、②で最低必要単位数を超えて修得した単位は、③の大学が独自に設定する科目の単位数に算入することができます。",
            "score": 0.5616445177238739
        },
        {
            "id": 299,
            "text": "資格取得関係科目　教育職員免許状受領資格取得関係科目： 教師論 自由：2単位 1年・後期 対象：全学部 教育原理 自由：2単位 2年・前期 対象：全学部 教育心理学 自由：2単位 2年・後期 対象：全学部 教育課程論 自由：1単位 2年・第3ターム（後期） 対象：全学部 教育経営学 自由：2単位 3年・前期 対象：情報芸術注10　特別支援教育論 自由：1単位 3年前期 対象：全学部 生徒・進路指導論 自由：2単位 2年・前期 対象：全学部 道徳教育論 自由：2単位 2年・後期 対象：全学部  教育方法・技術論 自由：1単位 2年・後期 対象：全学部  教育相談論 自由：2単位 2年前期 対象：全学部 情報通信技術を活用した教育の理論 自由：1単位 2年・後期 対象：全学部　総合的な学習の時間論 自由：1単位 2年・第3ターム（後期） 対象：全学部　特別活動論　自由：1単位 3年・第4ターム（前期） 対象：全学部 教科教育法（美術）ＡⅠ 自由：2 2年・前期 対象：芸術 教科教育法（美術）ＡⅡ 自由：2 2年・後期 対象：芸術 教科教育法（美術）ＢⅠ 自由：2 3年・前期 対象：芸術 教科教育法（美術）ＢⅡ 自由：2 3年・後期 対象：芸術 教科教育法（工芸）Ⅰ 自由：2 3年・前期 対象：芸術 教科教育法（工芸）Ⅱ 自由：2 3年・後期 対象：芸術 教育実習Ⅰ 自由：3 4年次 対象：全学部 教育実習Ⅱ 自由：2 4年次 対象：全学部 教職実践演習（中等）Ｃ 自由：2 4年・後期 対象：芸術 学校インターンシップ 自由：2 2・3・4年次 対象：国際・芸術 教職特講 自由：2 3年・後期 対象：全学部 学芸員資格取得関係科目： 生涯学習概論 自由：2単位 1年・後期 対象：芸術注10 博物館教育論 自由：2単位 2年・前期 対象：芸術注11 博物館資料論 自由：2単位 2年・後期 対象：芸術注11 博物館概論 自由：2単位 3年・前期 対象：芸術注11 博物館経営論 自由：2単位 3年・後期 対象：芸術注11 博物館資料保存論 自由：2単位 3年・後期 対象：芸術注11 博物館展示論 自由：2単位 3年・後期 対象：芸術注11 博物館情報・メディア論 自由：2単位 3年・後期 対象：芸術注11  博物館実習 自由：3単位 4年次 対象：芸術注11 注10 　国際学部は学部専門科目（公共政策・NPOプログラム）の選択科目として履修すること。 注11 　国際学部の学生が履修するためには、「他学部履修」の手続きを行う必要があります。 ",
            "score": 0.5603537456831038
        },
        {
            "id": 291,
            "text": "教員を目指す人：教育職員免許状の取得を希望する人は、本学を卒業する ために必要な単位を修得し、かつ、教育職員免許法の定め るところにより所定の単位を修得する必要があります。また、教職課程を履修するためには、履修登録の際に毎回教 職課程登録をしなければなりません。",
            "score": 0.49610320171194094
        },
        {
            "id": 295,
            "text": "今後のスケジュール:1年次（2024年）以降毎年度前期及び後期 教職課程登録:・ 履修登録期限までに登録 2025年度後期（2年次）履修カルテガイダンス：・履修カルテの説明・受取※3年次、4年次にも教職科目講義中に適宜ガイダンスが行われる 2026年1月〜 2月（2年次）介護等体験学内事前指導：・介護等体験申込　教育実習事前指導①：・外部講師による講演・教育実習の内諾申込の方法説明 2026年4月（3年次）介護等体験ガイダンス：・ 申込書、学生個人票の記入・体験費用の納入 2026年5月（3年次） 介護等体験合同事前指導：・広島地区大学合同事前指導 2026年7月～ 8月（3年次） 介護等体験直前指導：・外部講師による講演 2026年5月～ 8月末（3年次）教育実習校へ内諾申込：・各自母校を訪問し、教育実習申込 2026年6月～2027年1月（３年次）介護等体験：・ 特別支援学校（2日間）及び社会福祉施設（5日間）での介護等体験 2027年4月(４年次）教育実習事前指導②：・教育実習簿の受取・教育実習費の納入 2027年5月～（4年次） 教育実習・ 2 週間又は3週間の教育実習 2027年10月（4年次）教員免許状申請説明会：・申請方法の説明 教育実習事後指導  ",
            "score": 0.4745756355628131
        },
        {
            "id": 280,
            "text": "第２２条 教育職員の免許状を受ける資格を得ようとする学生は、教育職員免許法（昭和24年法律第147号）及び教育職員免許法施行規則（昭和29年文部省令第26号）に定めるところにより、教科及び教科の指導法に関する科目又は教育の基礎的理解に関する科目を履修しなければならない。２ 前項の科目の授業科目、単位数及び履修方法は、別表第３に掲げるとおりとする。",
            "score": 0.46467557434106527
        },
        {
            "id": 281,
            "text": "教育職員免許状を取得するためには、以下に記載する「教科及び教科の指導法に関する科目」、「教育の基礎的理解に関する 科目等」、「大学が独自に設定する科目」から 合計59単位以上 修得するとともに、「教育職員免許法施行規則第66条の6に 定める科目」を修得する必要があります。（中学校教諭一種免許状にあっては、「介護等体験」も必要です。）",
            "score": 0.4632950935862403
        }
    ]
}