{
    "query_line": "2022年度入学の情報科学部生です。授業科目の時間割を出してください",
    "related_sentences": [
        {
            "id": 642,
            "text": "情報科学部4学科共通 専門基礎科目：解析学Ⅰ 必修：2単位 １年・前期 解析学Ⅰ演習 必修：1単位 １年・前期 線形代数学Ⅰ 必修：２単位 １年・前期 線形代数学Ⅰ演習 必修：1単位 １年・前期 プログラミングⅠ 必修：２単位 １年・第2ターム(前期) プログラミングⅠ演習 必修：１単位 １年・第2ターム(前期) コンピュータ基礎 必修：2単位 １年・前期 情報科学英語必修：1単位 １年・第2ターム（前期） 解析学Ⅱ 選択：2単位 １年・後期 線形代数学Ⅱ 必修：２単位 １年・後期 実社会指向基礎数学 必修：２単位 １年・後期 プログラミングⅡ 必修：２単位 １年・後期 プログラミングⅡ演習 必修：１単位 １年・後期 データ構造とアルゴリズムⅠ 必修：2単位 １年・後期 情報科学序説 選択：１単位 １年・第3ターム（後期） 離散数学 選択：２単位 ２年・第1ターム（前期） 確率統計 必修：２単位 ２年・第1ターム（前期） 情報基礎数学 選択：2単位 ２年・第2ターム（前期） 幾何学概論 自由：２単位 ２年・第1ターム（前期） 情報ネットワーク 選択：２単位 ２年・第1ターム（前期） データ構造とアルゴリズムⅡ 選択：２単位 ２年・第2ターム（前期） 実践的AI技術 選択：２単位 ２年・第2ターム（前期） 批判的創造的思考法 選択：2単位 ２年・第4ターム（後期） 実践的ICT活用事例 選択：2単位 ２年・第4ターム（後期） 課題解決型演習 選択：１単位 ２年次○地 システム開発実践 選択：２単位 ３年次○地 情報科学基礎実験ａ 必修：１単位 ２年次 情報科学基礎実験ｂ 必修：１単位 ２年次 情報科学基礎実験ｃ 必修：１単位 ２年次 情報セキュリティ基礎 必修：２単位 ２年・第3ターム（後期） モデル化とシミュレーション 選択：２単位 ２年・第3ターム（後期）",
            "score": 0.5425820311887662
        },
        {
            "id": 588,
            "text": "第４条 各専攻における授業科目の履修時期及び授業時間割表は、毎学年の始めに発表する。 ２ 学生は、指導教員の指導により、履修しようとする授業科目を決定しなければならない。",
            "score": 0.5313121955121448
        },
        {
            "id": 650,
            "text": "情報科学部では、授業内容や宿題などに関する、学生の個別学習相談を随時受け付けています。教員の所在は、学内サイネージ等に掲示されていますので、確認の上、研究室などを訪ねてみてください。",
            "score": 0.5200855575222735
        },
        {
            "id": 611,
            "text": "授業時間：日々の授業は次の時間に行われます。1 時限9：00 ～ 10：30 2 時限10：40 ～ 12：10 3 時限13：00 ～ 14：30 4 時限14：40 ～ 16：10 5 時限16：20 ～ 17：50 6 時限18：00 ～ 19：30 注）6時限は補講用で、通常の授業は行いません。",
            "score": 0.4924036340766154
        },
        {
            "id": 643,
            "text": "情報工学科 専門科目：テクニカルR&W演習 必修：１単位 ３年・第3ターム（後期） テクニカルコミュニケーション演習 必修：１単位 ３年・第1ターム（前期）プログラミングⅢ 選択：２単位 ２年・第2ターム（前期） 常微分方程式 選択：２単位 ２年・第1ターム（前期） 注4 観光情報学 選択：２単位 ２年・第2ターム（前期） ○地 高度プログラミングＡ 選択：１単位 ２年・後期 高度プログラミングＢ 選択：１単位 ２年・第1ターム（前期） 高度プログラミングＣ 選択：１単位 ２年・第2ターム（前期） 高度プログラミングＤ 選択：１単位 ２年・第2ターム（前期） デジタルデザイン 選択：２単位 ２年・第3ターム（後期） オペレーティングシステム 選択：２単位 ２年・第3ターム（後期） ネットワークプロトコル 選択：２単位 ２年・第3ターム（後期） コンピュータグラフィックスⅠ 選択：２単位 ２年・第4ターム（後期） 注4 コンピュータアーキテクチャ 選択：2単位 ２年・第4ターム（後期） 物理学 選択：２単位 ２年・第4ターム（後期） 情報システム開発 選択：２単位 ２年・第3ターム（後期） 最適化技法 選択：２単位 ２年・第4ターム（後期） 技術者倫理 選択：２単位 ２～４年次・前期 情報と職業 選択：２単位 ２～４年次・前期 知的財産権 選択：２単位 ２～４年次・前期 情報セキュリティ応用 選択：２単位 ３年・第1ターム（前期） データベース 選択：２単位 ３年・第1ターム（前期） 情報工学実験Ⅰ 必修：1.５単位 ３年・第1ターム（前期） 情報工学実験Ⅱ 必修：1.５単位 ３年・第2ターム（前期） ネットワーク設計 選択：２単位 ３年・第1ターム（前期） コンピュータシステム 選択：2単位 ３年・第2ターム（前期） ネットワーク基盤技術 選択：２単位 ３年・第2ターム（前期） 情報理論 選択：２単位 ３年・第2ターム（前期） 医用データサイエンス 選択：２単位 ３年第1ターム(前期) リコンフィギャラブルコンピューティング 選択：２単位 ３年・第3ターム（後期） 分散システム 選択：２単位 ３年・第2ターム（前期） ネットワークソフトウェア 選択：２単位 ３年・第3ターム（後期） センサシステム 選択：２単位 ３年・第3ターム（後期） 情報工学実験Ⅲ 必修：1.5単位 ３年・第3ターム（後期） 情報工学実験Ⅳ 必修：1.5単位 ３年・第4ターム（後期） 画像情報処理 選択：２単位 ３年・第4ターム（後期） 注4 設計最適化手法 選択：２単位 ３年・第4ターム（後期） 信頼性工学 選択：２単位 ３年・第4ターム（後期） ワイヤレスネットワーク 選択：２ ３年・第4ターム（後期） トラフィック分析 選択：２単位 ３年・第4ターム（後期） デジタル信号処理 選択：２単位 ３年・第3ターム（後期） プレゼンテーション技法 必修：1単位 4年次注3 技術文書作成法　必修：1単位 ４年次注3 卒業研究Ⅰ 必修：４単位 ４年次注3 卒業研究Ⅱ 必修：４単位 ４年次注3 注3 卒業研究等履修要件：（1） 　卒業研究Ⅰ、卒業研究Ⅱはともに履修期間はそれぞれ半期である。 （2） 　卒業研究Ⅰ、卒業研究Ⅱはともに前後期いずれの学期においても履修は可能であるが、卒業研究Ⅱについては、卒 業研究Ⅰの単位修得者にのみ履修が認められる。 （3） 　プレゼンテーション技法、技術文書作成法はともに履修期間はそれぞれ半期である。 （4） 　原則として、技術文書作成法は卒業研究Ⅱと同じ履修期に履修すること。 注4：教職課程登録者のみ履修登録可 ",
            "score": 0.47368859146185566
        },
        {
            "id": 645,
            "text": "システム工学科 専門科目：外書講読演習Ⅱ 必修：１単位 ３年・第4ターム（後期）常微分方程式 選択：２単位 ２年・第1ターム（前期） 観光情報学 選択：２単位 ２年・第2ターム（前期） ○地 高度プログラミングＡ 選択：１単位 ２年・後期 高度プログラミングＢ 選択：１単位 ２年・第1ターム（前期） 高度プログラミングＣ 選択：１単位 ２年・第2ターム（前期） 高度プログラミングＤ 選択：１単位 ２年・第2ターム（前期） 電気回路 選択：２単位 ２年・第2ターム（前期） プログラミングⅢ 選択：２単位 ２年・第1ターム（前期） プログラミングⅢ演習 選択：１単位 ２年・第2ターム（前期） 物理学 選択：２単位 ２年・第4ターム（後期） 情報理論 選択：２単位 ２年・第1ターム（前期） 応用幾何学 選択：２単位 ２年・第3ターム（後期） 情報システム開発 選択：２単位 ２年・第3ターム（後期） 機械力学 選択：２単位 ２年・第3ターム（後期） 電子回路 選択：２単位 ２年・第4ターム（後期） コンピュータグラフィックス 選択：２単位 ２年・第4ターム（後期） 離散時間システム 選択：２単位 ２年・第4ターム（後期） オペレーティングシステム 選択：２単位 ２年・第3ターム（後期） 数値計算法 選択：２単位 3年・第1ターム（前期） 知的財産権 選択：２単位 ２～４年・前期 情報と職業 選択：２単位 ２～４年・前期 技術者倫理 選択：2単位 ２～４年・前期 システム工学実験Ⅰ 必修：1.5単位 3年・第1ターム（前期） システム工学実験Ⅱ 必修：1.5単位 3年・第2ターム（前期） メカトロニクス 選択：２単位 3年・第2ターム（前期） 制御工学Ⅰ 選択：２単位 3年・第2ターム（前期） ロボティクスⅠ 選択：２単位 3年・第1ターム（前期） 最適化手法 選択：２単位 3年・第1ターム（前期） ディジタル無線通信 選択：２単位 3年・第2ターム（前期） 外書講読演習 必修：１単位 3年・第2ターム（前期） 情報代数学 選択：２単位 3年・第1ターム（前期） 確率過程論 選択：２単位 3年・第1ターム（前期） データベース 選択：２単位 3年・第1ターム（前期） 注4 ヒューマンインタフェースⅠ 選択：２単位 3年・第2ターム（前期） ヒューマンインタフェースⅡ 選択：２単位 3年・第3ターム（後期） 医用データサイエンス 選択：２単位 3年・第1ターム（前期）  ソフトウエア工学概論 選択：２単位 3年・第3ターム（後期） 画像情報処理 選択：２単位 3年・第1ターム（前期） 制御工学Ⅱ 選択：２単位 ３年・第3ターム（後期） 偏微分方程式 選択：２単位 ３年・第4ターム（後期） ロボティクスⅡ 選択：２単位 ３年・第3ターム（後期） パターン認識 選択：２単位 ３年・第4ターム（後期） 情報セキュリティ応用 選択：２単位 ３年・第4ターム（後期） ソフトコンピューティング 選択：２単位 ３年・第4ターム（後期） システム工学実験Ⅲ 必修：1.5単位 ３年・第3ターム（後期） システム工学実験Ⅳ 必修：1.5単位 ３年・第4ターム（後期） プレゼンテーション技法 必修：1単位 4年次注3 技術文書作成法 必修：1単位 4年次注3 卒業研究Ⅰ 必修：４単位 4年次注3 卒業研究Ⅱ 必修：４単位 4年次注3 注3：卒業研究等履修要件（1）卒業研究Ⅰ、卒業研究Ⅱはともに履修期間はそれぞれ半期である。 （2） 　卒業研究Ⅰ、卒業研究Ⅱはともに前後期いずれの学期においても履修は可能であるが、卒業研究Ⅱについては、卒 業研究Ⅰの単位修得者にのみ履修が認められる。 （3） 　プレゼンテーション技法、技術文書作成法はともに履修期間はそれぞれ半期である。 （4） 　原則として、プレゼンテーション技法は卒業研究Ⅰと同じ履修期に、技術文書作成法は卒業研究Ⅱと同じ履修期に 履修すること。 注4：教職課程登録者のみ履修登録可",
            "score": 0.46787460398731706
        },
        {
            "id": 640,
            "text": "外国語系科目 英語科目： eラーニング英語Ⅰ 必修：1単位 1年・前期 対象：情報 eラーニング英語Ⅱ 必修：1単位 1年・後期 対象：情報 eラーニング英語Ⅲ 必修：1単位 2年・前期 対象：情報 eラーニング英語Ⅳ 必修：1単位 2年・後期 対象：情報 英語応用演習Ⅰ 必修：1単位 1年・前期 対象：全学部 英語応用演習Ⅱ 必修：1単位 1年・後期 対象：全学部 英語応用演習Ⅲ 必修：1単位 2年・前期 対象：情報 英語応用演習Ⅳ 必修：1単位 2年・後期 対象：情報 英語以外の外国語系科目：ドイツ語Ⅰ 選択：2単位 1年・前期 対象：全学部 ドイツ語Ⅱ 選択：2単位 1年・後期 対象：全学部 ドイツ語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 ドイツ語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 フランス語Ⅰ 選択：2単位 1年・前期 対象：全学部 フランス語Ⅱ 選択：2単位 1年・後期 対象：全学部 フランス語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 フランス語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 中国語Ⅰ 選択：2単位 1年・前期 対象：全学部 中国語Ⅱ 選択：2単位 1年・後期 対象：全学部 中国語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 中国語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 ハングルⅠ 選択：2単位 1年・前期 対象：全学部 ハングルⅡ 選択：2単位 1年・後期 対象：全学部 ハングルⅢ 選択：2単位 1・2年・前期 対象：全学部注8  ハングルⅣ 選択：2単位 1・2年・後期 対象：全学部注8 アラビア語Ⅰ 選択：2単位 1年・前期 対象：全学部 アラビア語Ⅱ 選択：2単位 1年・後期 対象：全学部 アラビア語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 アラビア語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 ロシア語Ⅰ 選択：2単位 1年・前期 対象：全学部 ロシア語Ⅱ 選択：2単位 1年・後期 対象：全学部 ロシア語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 ロシア語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 イタリア語Ⅰ 選択：2単位 1年・前期 対象：全学部 イタリア語Ⅱ 選択：2単位 1年・後期 対象：全学部 イタリア語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 イタリア語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 スペイン語Ⅰ 選択：2単位 1年・前期 対象：全学部 スペイン語Ⅱ 選択：2単位 1年・後期 対象：全学部 スペイン語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 スペイン語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 日本語Ⅰ 選択：2単位 1年・前期 対象：全学部注9 日本語Ⅱ 選択：2単位 1年・後期 対象：全学部注9 日本語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8注9 日本語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8注9 注7：前期・後期とも開講するので、国際学部の学生は別途掲示するクラス分け表により前期又は後期のいずれかを履修すること。注8：１年生が履修する場合は、科目担当教員の承認が必要です。 注9：外国人留学生対象の科目であり、日本人学生は履修できません。",
            "score": 0.464127184349734
        },
        {
            "id": 635,
            "text": "イノベーション人材育成プログラム（情報科学部）：情報科学部では、ICT活用に不可欠なプログラミングや情報科学の基礎となる数学において秀でた能力を、学習意欲 と共にさらに伸ばす「イノベーション人材育成プログラム」 により、社会にイノベーションをもたらし得る人材を育成 します。 　本プログラムでは、標準で開講されている科目群に加え、 実践的な情報技術のプロフェッショナルを育成する「革新 的 ICT 実践特別コース」、科学的探究能力をもつIT技術者を 育成する「革新的情報科学特別コース」、および両者の共通 科目群の科目を履修できます。いずれの科目群でも創造力 を養うことができます。総合型選抜推薦入試による入学者 は優先的に履修できますが、情報科学部に入学したすべて の学生が履修にチャレンジできます。 　本プログラムは大学院との一貫カリキュラムを想定して おり、所定の成績でプログラムを修了した学生は、通常４ 年次で履修する卒業研究を飛ばして、早期に大学院に進学 し先端的な研究を開始することができます。 　本プログラムを修了することで、ICTに必要な基本知識や 動作原理を身につけるのみならず、社会の課題に目を向け、 創造的な解決策に挑戦するマインドが身につきます。社会 の変化とニーズに対応できる実践的なICT人材として活躍できます。",
            "score": 0.46147260469751683
        },
        {
            "id": 609,
            "text": "科目の種類 　授業科目は講義、演習、実験、実習、実技などに区分され、 それぞれ授業時間や単位数が異なっています。また、大学 からの説明では、科目の性質によって以下のように区分さ れることがありますので、よく理解しておくようにしましょう。授業科目の詳細は教育課程《2024年度入学生版》を参 照してください。 ◆　必修科目 卒業のために必ず取得しなければならない科目です。 ◆　選択科目 　 　複数の科目の中から、いくつかを選択することのでき る科目です。卒業要件（教育課程《2024年度入学生版》） をよく理解したうえで選択する必要があります。 ◆　自由科目 　 　興味関心に応じて自由に選択することのできる科目で す。例えば、資格取得関係科目が該当します。卒業要件 単位には数えられませんので注意してください            ",
            "score": 0.46072618624710127
        },
        {
            "id": 644,
            "text": "知能工学科 専門科目：オートマトンと形式言語 必修：２単位 2年・第4ターム（後期） 常微分方程式 選択：２単位 2年・第1ターム（前期） 注4 観光情報学 選択：２単位 2年・第2ターム（前期） ○地 高度プログラミングＡ 選択：１単位 2年・後期 高度プログラミングＢ 選択：１単位 2年・第1ターム（前期） 高度プログラミングＣ 選択：１単位 2年・第2ターム（前期） 高度プログラミングＤ 選択：１単位 2年・第2ターム（前期） 数理計画法 選択：２単位 2年・第3ターム（後期） 数理論理学 選択：２単位 2年・第3ターム（後期） コンピュータグラフィックスⅠ 選択：２単位 2年・第4ターム（後期） プログラミングⅢ 選択：2単位 2年・第3ターム（後期） プログラミングⅢ演習 選択：1単位 2年・第3ターム（後期） グラフ理論 選択：２単位 2年・第4ターム（後期） オペレーティングシステム 選択：２単位 2年・第4ターム（後期） ディジタル信号処理 選択：２単位 2年・後期 数値解析 選択：２単位 2年・第4ターム（後期） 情報システム開発 選択：２単位 2年・第3ターム（後期） ソフトウェア工学概説 選択：２単位 3年・第4ターム（後期） 技術者倫理 選択：２単位 ２～４年次・前期 情報と職業 選択：２単位 ２～４年次・前期 知的財産権 選択：２単位 ２～４年次・前期 情報理論 選択：２単位 3年・第1ターム（前期） 記号処理プログラミング 選択：２単位 3年・第1ターム（前期） データベース 選択：2単位 3年・第1ターム（前期） 人工知能 選択：２単位 3年・第2ターム（前期） 技術英語演習Ⅰ 必修：１単位 3年・第4ターム（後期） 知能工学実験Ⅰ 必修：1.5単位 3年・第1ターム（前期） 知能工学実験Ⅱ 必修：1.5単位 3年・第2ターム（前期） コンパイラ 選択：２単位 3年・第2ターム（前期） 計算論 選択：２単位 3年・第2ターム（前期） コンピュータグラフィックスⅡ 選択：２単位 3年・第2ターム（前期） パターン認識 選択：２単位 3年・第2ターム（前期） 情報検索 選択：２単位 3年・第1ターム（前期） 医用データサイエンス 選択：２単位 3年・第1ターム(前期) 自然言語処理 選択：２単位 3年・第1ターム（前期） 医用画像処理 選択：２単位 3年・第3ターム（後期） データマイニング 選択：２単位 3年・第3ターム（後期） バイオインフォマティクスⅠ 選択：１単位 3年・第3ターム（後期） バイオインフォマティクスⅡ 選択：１単位 3年・第4ターム（後期） 知能工学実験Ⅲ 必修：1.5単位 ３年・第3ターム（後期） 知能工学実験Ⅳ 必修：1.5単位 ３年・第4ターム（後期） 機械学習 選択：２単位 ３年・第4ターム（後期） 感性情報処理 選択：２単位 ３年・第3ターム（後期） 画像情報処理 選択：２単位 ３年・第4ターム（後期） プレゼンテーション技法　必修：1単位 4年次注3 技術英語演習Ⅱ 必修：１単位 ３年・第4ターム（後期） 技術文書作成法　必修：1単位 4年次注3 卒業研究Ⅰ 必修：4単位 4年次注3 卒業研究Ⅱ 必修：4単位 4年次注3 注3：卒業研究等履修要件 （1） 　卒業研究Ⅰ、卒業研究Ⅱはともに履修期間はそれぞれ半期である。 （2） 　卒業研究Ⅰ、卒業研究Ⅱはともに前後期いずれの学期においても履修は可能であるが、卒業研究Ⅱについては、卒 業研究Ⅰの単位修得者にのみ履修が認められる。 （3） 　プレゼンテーション技法、技術英語演習Ⅱ、技術文書作成法はともに履修期間はそれぞれ半期である。 （4） 　原則として、プレゼンテーション技法及び技術英語演習Ⅱは卒業研究Ⅰと同じ履修期に、技術文書作成法は卒業研 究Ⅱと同じ履修期に履修すること。 注4：教職課程登録者のみ履修登録可",
            "score": 0.45434626989300503
        }
    ]
}