{
    "query_line": "2024年度入学の国際学部生です。2年の進級条件を教えてください",
    "related_sentences": [
        {
            "id": 2609,
            "text": "履修基準：国際学部 1　総合共通科目 　前ページの表の基準により履修してください。 2　一般情報処理科目 　「情報活用基礎」（２単位）を履修してください。 3　保健体育科目 　「体育実技Ⅰ・体育実技Ⅱ」（各１単位、計２単位）又は 「健康科学」（２単位）のいずれかを選択して履修してくだ さい。両方を履修しても構いませんが、卒業単位としては 2単位しか算入されません。 4　外国語系科目 　以下の基準に従い、必修８単位、選択４単位の計12単位以上履修してください。必　修（８単位）英語科目：「CALL英語集中I」、「CALL英語集中II」、「英語応用演習I」、「英語応用演習II」（各１単位）をすべて取得 ４単位 第二外国語科目：アラビア語、イタリア語、スペイン語、中国語、ドイツ語、ハングル、フランス語、ロシア語の８言語の中から同一言語をひとつ選択し、IからⅣ（各２単位）のうち2科目の単位を取得（日本語の授業は留学生のみ対象）４単位 いずれか選択（４単位）選択１：英語科目「CALL英語集中Ⅲ」、「CALL英語集中Ⅳ」、「英語応用演習Ⅲ」、「英語応用演習 Ⅳ」（各１単位）をすべて単位取得 ４単位 選択２：第二外国語科目 アラビア語、イタリア語、スペイン語、中国語、ドイツ語、ハングル、フランス語、ロシア語の８言語の中から必修で取得した第二外国語科目と同一言語を選択し、ＩからⅣ（各２単位）まですべて単位取得（日本語の授業は留学生のみ対象）４単位【参考：履修パターン】 　基準に当てはめると履修パターンは、英語を主として履修するパターンと、同一言語の第二外国語を主として履修 するパターンのいずれか２つです。なお、履修パターンは、 最低限の要件を満たすもので、いずれもこの履修パターン を踏まえた上でのさらなる外国語の積極的な履修を妨げるものではありません。＜英語を主とする履修パターン＞（カッコ内は単位数）１年次前期：CALL英語集中Ⅰ（1）英語応用演習Ⅰ（1）第二外国語Ⅰ（2)後期：CALL英語集中Ⅱ（1）英語応用演習Ⅱ（1）第二外国語Ⅱ（2）２年次前期：CALL英語集中Ⅲ（1）英語応用演習Ⅲ（1）後期：CALL英語集中Ⅳ（1）英語応用演習Ⅳ（1）合計単位：計12単位以上 ＜同一の第二外国語を主とする履修パターン＞（カッコ内は単位数）１年次前期：CALL英語集中Ⅰ（1）英語応用演習Ⅰ（1）第二外国語Ⅰ（2）後期：CALL英語集中Ⅱ（1）英語応用演習Ⅱ（1）第二外国語Ⅱ（2）２年次前期：第二外国語Ⅲ（2）後期：第二外国語Ⅳ（2）合計単位：計12単位以上",
            "score": 0.505649255959528
        },
        {
            "id": 2608,
            "text": "卒業要件：卒業するためには、4年以上在学し、次の表に定める単位を修得しなければなりません。この要件は、卒業するまで有効です。必ず自身の入学年度の要件を確認してください。国際学部 全学共通系科目（Ａ）広島・地域志向科目：２単位以上 平和科目：２単位以上 共通科目Ａ(人間と社会)：4単位以上 共通科目Ｂ(数理と自然)：２単位以上 共通科目Ｃ(芸術)：２単位以上 初年次演習科目：1単位 キャリア形成・実践科目：1単位以上 総合共通科目小計14単位以上 一般情報処理科目 2単位 保健体育科目 2単位 外国語系科目（B） 12単位以上 全学共通系科目等計（A+B） 30単位以上 専門教育科目 専門基礎科目：9単位以上 専門科目：84単位以上 計93単位以上 卒業必要単位数128単位",
            "score": 0.5028349479630005
        },
        {
            "id": 2622,
            "text": "専門科目：アクティブ科目 国際交流：国際研究特講Ⅰ 選択：2単位 全学年 国際研究特講Ⅱ 選択：2単位 全学年 海外短期英語留学 選択：2単位 全学年 海外短期フランス語留学 選択：４単位 全学年 海外短期ロシア語留学 選択：2単位 全学年 海外短期中国語留学 選択：2単位 全学年 HIROSHIMA and PEACE 選択：2単位 ２・３・４年次 インターンシップ： 企業インターンシップ 選択：2単位 ２・３・４年次 学部派遣海外インターンシップ 選択：2単位 ２・３・４年次 公的機関インターンシップ 選択：2単位 ２・３・４年次 演習： 専門演習Ⅰ 必修：1単位 ３年次注1 専門演習Ⅱ 必修：1単位 ３年次注1 卒論演習Ⅰ 必修：1単位 ４年次 卒論演習Ⅱ 必修：1単位 ４年次 注1：専門演習について（1）専門演習の分野から2単位以上（演習Ⅰと演習Ⅱを各1単位以上）を履修すること。（2)「専門演習Ⅰ」は前期履修を、「専門演習Ⅱ」は後期履修を原則とし、事前に指導教員の許可があった場合、「専門演習Ⅰ」の後期履修又は「専門演習Ⅱ」の前期履修が認められる。",
            "score": 0.4701648721675461
        },
        {
            "id": 2614,
            "text": "専門教育科目 専門基礎科目：ベーシック入門科目 国際研究入門 必修：2単位 1年・前期 データ分析入門 自由：2単位 1年・後期 ベーシック演習科目 基礎演習 必修：1単位 1年・後期 発展演習Ⅰ 必修：1単位 2年・前期 発展演習Ⅱ 必修：1単位 2年・後期 英語スキルアップ科目 英語読解法Ⅰ 自由：2単位 2年・前期 英語読解法Ⅱ 自由：2単位 2年・後期 英語討論技法Ⅰ 自由：2単位 2年・前期 英語討論技法Ⅱ 自由：2単位 2年・後期 英文作法Ⅰ 自由：2単位 2年・前期 英文作法Ⅱ 自由：2単位 2年・後期",
            "score": 0.464401275670544
        },
        {
            "id": 2612,
            "text": "外国語系科目 英語科目： CALL英語集中Ⅰ 必修：1単位 1年・前期 対象：国際・芸術 CALL英語集中Ⅱ 必修：1単位 1年・後期 対象：国際・芸術 CALL英語集中Ⅲ 選択：1単位 2年・前期 対象：国際・芸術 CALL英語集中Ⅳ 選択：1単位 2年・後期 対象：国際・芸術 英語応用演習Ⅰ 必修：1単位 1年・前期 対象：全学部 英語応用演習Ⅱ 必修：1単位 1年・後期 対象：全学部 英語応用演習Ⅲ 選択：1単位 2年・前後期 対象：国際注7 英語応用演習Ⅳ 選択：1単位 2年・前後期 対象：国際注7 英語以外の外国語系科目：ドイツ語Ⅰ 選択：2単位 1年・前期 対象：全学部 ドイツ語Ⅱ 選択：2単位 1年・後期 対象：全学部 ドイツ語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 ドイツ語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 フランス語Ⅰ 選択：2単位 1年・前期 対象：全学部 フランス語Ⅱ 選択：2単位 1年・後期 対象：全学部 フランス語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 フランス語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 中国語Ⅰ 選択：2単位 1年・前期 対象：全学部 中国語Ⅱ 選択：2単位 1年・後期 対象：全学部 中国語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 中国語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 ハングルⅠ 選択：2単位 1年・前期 対象：全学部 ハングルⅡ 選択：2単位 1年・後期 対象：全学部 ハングルⅢ 選択：2単位 1・2年・前期 対象：全学部注8  ハングルⅣ 選択：2単位 1・2年・後期 対象：全学部注8 アラビア語Ⅰ 選択：2単位 1年・前期 対象：全学部 アラビア語Ⅱ 選択：2単位 1年・後期 対象：全学部 アラビア語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 アラビア語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 ロシア語Ⅰ 選択：2単位 1年・前期 対象：全学部 ロシア語Ⅱ 選択：2単位 1年・後期 対象：全学部 ロシア語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 ロシア語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 イタリア語Ⅰ 選択：2単位 1年・前期 対象：全学部 イタリア語Ⅱ 選択：2単位 1年・後期 対象：全学部 イタリア語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 イタリア語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 スペイン語Ⅰ 選択：2単位 1年・前期 対象：全学部 スペイン語Ⅱ 選択：2単位 1年・後期 対象：全学部 スペイン語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8 スペイン語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8 日本語Ⅰ 選択：2単位 1年・前期 対象：全学部注9 日本語Ⅱ 選択：2単位 1年・後期 対象：全学部注9 日本語Ⅲ 選択：2単位 1・2年・前期 対象：全学部注8注9 日本語Ⅳ 選択：2単位 1・2年・後期 対象：全学部注8注9 注7：前期・後期とも開講するので、国際学部の学生は別途掲示するクラス分け表により前期又は後期のいずれかを履修すること。注8：１年生が履修する場合は、科目担当教員の承認が必要です。 注9：外国人留学生対象の科目であり、日本人学生は履修できません。学芸員資格取得関係科目： 生涯学習概論 自由：2単位 1年・後期 対象：芸術注10 博物館教育論 自由：2単位 2年・前期 対象：芸術注11 博物館資料論 自由：2単位 2年・後期 対象：芸術注11 博物館概論 自由：2単位 3年・前期 対象：芸術注11 博物館経営論 自由：2単位 3年・後期 対象：芸術注11 博物館資料保存論 自由：2単位 3年・後期 対象：芸術注11 博物館展示論 自由：2単位 3年・後期 対象：芸術注11 博物館情報・メディア論 自由：2単位 3年・後期 対象：芸術注11  博物館実習 自由：3単位 4年次 対象：芸術注11 注10 　国際学部は学部専門科目（公共政策・NPOプログラム）の選択科目として履修すること。 注11 　国際学部の学生が履修するためには、「他学部履修」の手続きを行う必要があります。 ",
            "score": 0.4641354620565802
        },
        {
            "id": 2610,
            "text": "卒業論文等登録条件 ４年次に進級し、卒業論文、卒業研究、卒業制作の履修 登録を行うためには、各所属する学部・学科において設け ている条件を満たさなければなりません。各学部とも卒業 論文等は必修科目であり、履修登録ができないことは卒業 延期となることを意味します。 　４年生になって後悔しても始まりません。そんなことに ならないよう、今後、計画的に単位を修得するようにしてください。国際学部：卒業の要件となる128 単位のうち、90単位以上を修得",
            "score": 0.46004415562174905
        },
        {
            "id": 2531,
            "text": "１ この学則は、平成26年４月１日から施行する。（授業科目、単位数、卒業要件等に関する経過措置）２ この学則の施行の日（以下「施行日」という。）の前日において本学に在学し、施行日以後引き続き在学する者に係る授業科目、単位数、卒業要件等に関しては、次項及び第４項に定めるもののほか、この学則の規定にかかわらず、なお従前の例による。 ３ 別表第１の⑴国際学部国際学科の表の規定（ジェンダーとセクシュアリティ、フランス文化論及びフランスの文学と文化に係る部分に限る。）並びに別表第１の⑸情報科学部システム工学科の表の規定（機械力学に係る部分に限る。）は、平成25年度以前に入学した者にも適用する。 ４ 施行日以後において、本学に編入学、転学又は再入学した者に係る授業科目、単位数、卒業要件等に関しては、当該者の属する年次と同一年次に属する者の例による。",
            "score": 0.4393662892777811
        },
        {
            "id": 2611,
            "text": "全学共通系科目 総合共通科目 広島・地域志向科目 広島の観光学 選択：2単位 1・2年・前期 対象:全学部○地 ひろしま論 選択：2単位 1・2年・前期 対象:全学部○地 広島の産業と技術 選択：2単位 1・2年・後期 対象:全学部○地 地域再生論入門 選択：2単位 1・2年・前期 対象:全学部○地 NPO論 選択：2単位 1・2年・前期 対象:全学部○地 地域課題演習 選択：1単位 1・2年次 対象:全学部○地 平和科目 平和と人権A（ヒロシマと国際平和）選択：2単位 1・2年・前期 対象:全学部 平和と人権Ｂ（現代世界と人権）選択：2単位 1・2年・後期 対象:全学部 広島からの平和学：実践の方法 選択：2単位 1・2年・前期 対象:全学部 国際化時代の平和 選択：2単位 1・2年・後期 対象:全学部 「ヒロシマ」を考える 選択：2単位 1・2年・後期 対象:全学部 共通科目A （人間と社会） 哲学 選択：2単位 1・2年・後期 対象:全学部 世界の宗教 選択：2単位 1・2年・前期 対象:全学部 心理学 選択：2単位 1・2年・後期 対象:全学部 歴史学 選択：2単位 1・2年・前期 対象:全学部 現代史Ａ 選択：2単位 1・2年・前期 対象:全学部 現代史Ｂ 選択：2単位 1・2年・後期 対象:全学部 文学から学ぶ世界 選択：2単位 1・2年・後期 対象:全学部 法学（日本国憲法） 選択：2単位 1・2年・前後期 対象:全学部注2 政治学 選択：2単位 1・2年・後期 対象:全学部 経済学 選択：2単位 1・2年・前期 対象:全学部 社会学 選択：2単位 1・2年・前期 対象:全学部 文化人類学 選択：2単位 1・2年・後期 対象:全学部 自然人類学 選択：2単位 1・2年・前期 対象:全学部 経営学 選択：2単位 1・2年・後期 対象:全学部 心の健康・身体の健康 選択：2単位 1・2年・前期 対象:全学部 メディアと社会 選択：2単位 1・2年・後期 対象:全学部 自己の認識を深める 選択：2単位 1・2年・前期 対象:全学部 人間関係とコミュニケーション 選択：2単位 1・2年・後期 対象:全学部 共通科目B（数理と自然） 数学概論 選択：2単位 1・2年・前期 対象:国際・芸術 物理学概論 選択：2単位 1・2年・前期 対象:国際・芸術 基礎物理学 選択：2単位 1・2年・前期 対象:全学部注3 化学概論 選択：2単位 1・2年・後期 対象:国際・芸術 基礎化学 選択：2単位 1・2年・前期 対象:全学部注3 生物学概論 選択：2単位 1・2年・前期 対象:国際・芸術 基礎生物学 選択：2単位 1・2年・後期 対象:全学部注3 情報科学概論 選択：2単位 1・2年・後期 対象:国際・芸術 物理・化学実験 選択：2単位 1・2年・後期 対象:全学部注3 地球環境論 選択：2単位 1・2年・前期 対象:全学部 情報社会論 選択：2単位 1・2年・後期 対象:全学部 データサイエンス 選択：2単位 1・2年・後期 対象:全学部 共通科目C （芸術） デッサン概論 選択：2単位 1・2年前期 対象:国際・情報 油絵入門 選択：2単位 1・2年・第3ターム（後期） 対象:国際・情報 日本画入門 選択：2単位 1・2年・第3ターム（後期） 対象:国際・情報 立体造形概論 選択：2単位 1・2年 対象:・後期国際・情報 プレゼンテーション概論 選択：2単位 1・2年 対象:・前期全学部 デザイン工芸概論 選択：2単位 1・2年 対象:・後期全学部 コンピュータ・アート 選択：2単位 2年 対象:・後期全学部注4 創作と人間 選択：2単位 1・2年 対象:・前期全学部 初年次演習科目 3学部合同基礎演習 必修：1単位 1年 対象:・前期全学部 キャリア形成・実践科目 キャリアデザインⅰ 選択：1単位 1・2年・第1ターム（前期） 対象:全学部 キャリアデザインⅱ 選択：1単位 1・2年・第4ターム（後期） 対象:全学部 キャリアサポートベーシックＡ 選択：1単位 対象:2・3年・前期全学部 キャリアサポートベーシックＢ 選択：1単位 対象:2・3年・後期全学部 仕事体験演習　選択：1単位 1・2年 対象:・通年全学部 国際交流演習Ⅰ 選択：1単位 1 ～ 4年 対象:・通年全学部 国際交流演習Ⅱ 選択：1単位 1 ～ 4年 対象:・通年全学部 国際交流演習Ⅲ 選択：1単位 1 ～ 4年 対象:・通年全学部 国際交流演習Ⅳ 選択：1単位 1 ～ 4年 対象:・通年全学部 一般情報処理科目 情報活用基礎 必修：２単位 1年前期 対象：全学部注5 保健体育科目 健康科学 選択：2単位 1年・前期全学部 体育実技Ⅰ 選択：1単位 1年 対象：・前期全学部注6 体育実技Ⅱ 選択：1単位 1年 対象：・後期全学部注6 注1：履修時期は1年次でも2年次でもよいため、専門教育科目とのバランスを考えながら履修時期を決めてください。ただ し、3年次、4年次においても下年次履修は可能です。 注2：「法学（日本国憲法）」は、前期、後期どちらにも開講しますが、前期は国際学部生、後期は情報科学部生及び芸術学 部生を対象とします。 注3：対象学部は「全学部」としていますが、主として情報科学部の学生向けの講義内容となっています。 注4：対象学部は「全学部」としていますが、主として国際学部及び芸術学部の学生向けの講義内容となっています。 注5：情報科学部は第１ターム（前期）に行います。 注6：「体育実技Ⅰ」の種目は初回授業で、「体育実技Ⅱ」の種目は「体育実技Ⅰ」の最終授業で、希望調査を行い決定します。 再履修を希望する場合は、担当教員に相談してください。",
            "score": 0.43091509972318665
        },
        {
            "id": 2619,
            "text": "専門科目：5プログラム科目 国際ビジネスプログラム： 国際ビジネス入門 選択：2単位 1年・前期 会計学Ⅰ 選択：2単位 1年・後期 International Commerce 選択：2単位 1年・後期 会計学Ⅱ 選択：2単位 2年・前期 経営戦略論　選択：2単位 2年・前期 人的資源管理論　選択：2単位 2年・前期 国際経営論Ⅰ 選択：2単位 2年・前期 国際経営論Ⅱ 選択：2単位 2年・後期 マーケティング論Ⅰ 選択：2単位 2年・前期 備考：公共 マーケティング論Ⅱ 選択：2単位 2年・後期 多国籍企業論Ⅰ 選択：2単位 2年・前期 多国籍企業論Ⅱ選択： 2単位 2年・後期 財務管理論Ⅰ 選択：2単位 2年・前期 財務管理論Ⅱ 選択：2単位 2年・後期 経営史　選択：2単位 2年・第4ターム（後期） 備考：○地 公会計論 選択：2単位 2年・前期　備考：公共 国際会計論 選択：2単位 2年・後期 経営組織論 選択：2単位 2年・後期 International Business 選択：2単位 2年・後期 Introduction to Management 選択：2単位 2年・後期 国際貿易論 選択：2単位 3年・前期 国際金融論Ⅰ 選択：2単位 3年・前期公共 国際金融論Ⅱ 選択：2単位 3年・後期 国際ビジネス法務Ⅰ 選択：２単位 3年・前期公共 国際ビジネス法務Ⅱ 選択：2単位 3年・後期 テクノロジーマネジメント 選択：2単位 3年・後期 ",
            "score": 0.4306636631991382
        },
        {
            "id": 2615,
            "text": "【専門科目の「領域」認定】国際学部では、13ページから19ページまでの専門科目に５つのプログラムを設け、ひとつのプログラム科目（２つ以上 のプログラム科目に共通する授業科目を含む※）と５プログラム共通科目（地域研究等）から36単位以上を履修し、かつ、 アクティブ科目から６単位以上と卒業論文４単位の計46単位以上を履修して、当該プログラムの「領域」認定を受けるこ とが卒業要件です。 　ただし、領域認定に加算できる5プログラム共通科目（地域研究等）の単位数は８単位以内です。※　授業科目によっては、２つ以上のプログラムに共通する授業科目もあり、「備考欄」に下記の略号を付記しています。認定を受けたいプログラム科目 5プログラム共通科目（地域研究等：※8単位まで 36単位以上 + アクティブ科目：・専門演習Ⅰ・Ⅱ　（必修2単位）・卒論演習Ⅰ・Ⅱ　（必修2単位）・その他（2単位）6単位以上 卒業論文：※原則として、認定を受けたいプログラムに属する教員を指導教員とする 4単位 計46単位以上",
            "score": 0.41504968283206467
        }
    ]
}